# # 1. Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит 
# # на экран сумму трёх чисел или произведение трёх чисел.
# n1 = int(input("Введіть перше число: "))
# n2 = int(input("Введіть друге число: "))
# n3 = int(input("Введіть третє число: "))
# choice = input("Введіть 'сума' або 'добуток': ")
# if choice == 'сума':
#     result = n1 + n2 + n3 
#     print(f"Сума трьох чисел: {result}")
# elif choice == 'добуток':
#     result = n1 * n2 * n3
#     print(f"добуток трьох чисел: {result}")
# else:
#     print("Некоректний вибір операції")
# # 2. Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит 
# # на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
# n1 = int(input("Введіть перше число: "))
# n2 = int(input("Введіть друге число: "))
# n3 = int(input("Введіть третє число: "))
# choice = input("Введіть 'максимум', 'мінімум' або 'середнєарифметичне': ")
# if choice == 'максимум':
#     result = max(n1, n2, n3)
#     print(f"Максимум з трьох чисел: {result}")
# elif choice == 'мінімум':
#     result = min(n1, n2, n3)
#     print(f"Мінимум з трьох чисел: {result}")
# elif choice == 'середнєарифметичне':
#     result = (n1 + n2 + n3) / 3
#     print(f"Середнє арифметичне з трьох чисел: {result}")
# else:
#     print("Некоректний вибір операції")
# # 3. Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа 
# # переводит метры в мили, дюймы или ярды.
# meters = int(input("Введіть кількість метрів: "))
# choice = input("Введіть 'милі', 'дюйми' або 'ярди': ")
# if choice == 'милі':
#     miles = meters * 0.000621371
#     print(f"{meters} метрів дорівнює {miles} миль")
# elif choice == 'дюйми':
#     inches = meters * 39.3701
#     print(f"{meters} метрів дорівнює {inches} дюймів")
# elif choice == 'ярди':
#     yards = meters * 1.09361
#     print(f"{meters} метрів дорівнює {yards} ярдів")
# else:
#     print("Некоректний вибір одиниці")
# # 4. Пользователь вводит с клавиатуры номер дня недели 
# # (1-7). Необходимо вывести на экран названия дня недели. 
# # Например, если 1, то на экране надпись понедельник, 2 — вторник и т.д.
# day_number = int(input("Введіть номер дня тижня (1-7): "))
# days = {1: "понеділок",
#         2: "вівторок",
#         3: "середа",
#         4: "четвер",
#         5: "п'ятниця",
#         6: "субота",
#         7: "неділя"}
# if 1 <= day_number <= 7:
#     day_name = days[day_number]
#     print(f"Назва дня тижня з номером {day_number} - {day_name}")
# else:
#     print("Некоректний номер дня тижня. Введіть число від 1 до 7.")
# # 5. Пользователь вводит с клавиатуры номер месяца 
# # (1-12). Необходимо вывести на экран название месяца. 
# # Например, если 1, то на экране надпись январь, 2 — февраль и т.д. 
# month_number = int(input("Введіть номер місяця (1-12): "))
# months = [
#     "січень",
#     "лютий",
#     "березень",
#     "квітень",
#     "травень",
#     "червень",
#     "липень",
#     "серпень",
#     "вересень",
#     "жовтень",
#     "листопад",
#     "грудень"]
# if 1 <= month_number <= 12:
#     month_name = months[month_number - 1]
#     print(f"Назва місяця з номером {month_number} - {month_name}")
# else:
#     print("Некоректний номер місяця.Введіть число від 1 до 12.")
# # 6. Пользователь вводит с клавиатуры число. Если число 
# # больше нуля нужно вывести надпись «Number is positive», 
# # если меньше нуля «Number is negative», если равно нулю 
# # «Number is equal to zero»
# number = int(input("Введіть число: "))
# if number > 0:
#     print("Number is positive")
# elif number < 0:
#     print("Number is negative")
# else:
#     print("Number is equal to zero")
# # 7. Пользователь вводит два числа. Определить, равны 
# # ли эти числа, и, если нет, вывести их на экран в порядке 
# # возрастания
# n1 = int(input("Введіть перше число: "))
# n2 = int(input("Введіть друге число: "))
# if n1 == n2:
#     print("Числа рівні.")
# else:
#     sorted_numbers = sorted([n1, n2])
#     print(f"Числа в порядку зростання: {sorted_numbers[0]}, {sorted_numbers[1]}")